In [1]:
import pandas as pd
import numpy as np

In [2]:
serie_1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
serie_2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
serie_3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

In [4]:
df_1 = pd.concat([serie_1, serie_2, serie_3], axis=1)

In [6]:
df_1.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)

In [14]:
bigcolumn = pd.concat([serie_1, serie_2, serie_3], axis=0)
bigcolumn = bigcolumn.to_frame()

In [15]:
bigcolumn

        0
0       4
1       4
2       1
3       4
4       2
..    ...
95  24007
96  25273
97  14542
98  18950
99  23033

[300 rows x 1 columns]

In [16]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        4
2        1
3        4
4        2
..     ...
295  24007
296  25273
297  14542
298  18950
299  23033

[300 rows x 1 columns]